In [1]:
# pandas is a powerful data analysis library . develop on the top of numpy ,in pandas there are two type of data structues. 1. series 2.dataframe

series :- series is a class in pandas, the object of series class hold a one dimensional array. 
Data frame :- it is a class in pandas , the object of dataframe class hold a two dimentional array.

In [2]:
import numpy as np
import pandas as pd

In [3]:
import numpy as np
import pandas as pd
arr=np.linspace(1,10,5)
print(arr)

[ 1.    3.25  5.5   7.75 10.  ]

In [4]:
ser=pd.Series(arr)
print(ser)

0     1.00
1     3.25
2     5.50
3     7.75
4    10.00
dtype: float64

In [5]:
data={
    "empid" :[101,102,103,104,105], 
    "empname" :["Ankur", "Gufran", "Anurag", "Ravi", "Abhishek"],
    "salary" :[20000,300000,10000,40000,40000] 
    }
df=pd.DataFrame(data)
df

   empid   empname  salary
0    101     Ankur   20000
1    102    Gufran  300000
2    103    Anurag   10000
3    104      Ravi   40000
4    105  Abhishek   40000

In [6]:
# how to write data in CSV file
df.to_csv("emp.csv", index=False)

In [7]:
# read csv file 

df2=pd.read_csv("emp.csv")
df2

   empid   empname  salary
0    101     Ankur   20000
1    102    Gufran  300000
2    103    Anurag   10000
3    104      Ravi   40000
4    105  Abhishek   40000

In [8]:
# head () function in pandas daraframe display top five rows.

df2.head()

   empid   empname  salary
0    101     Ankur   20000
1    102    Gufran  300000
2    103    Anurag   10000
3    104      Ravi   40000
4    105  Abhishek   40000

In [9]:
df2.head(2)

   empid empname  salary
0    101   Ankur   20000
1    102  Gufran  300000

In [10]:
# tail() in pandsa data frame display last five row.

df2.tail()

   empid   empname  salary
0    101     Ankur   20000
1    102    Gufran  300000
2    103    Anurag   10000
3    104      Ravi   40000
4    105  Abhishek   40000

In [11]:
df2.tail(2)

   empid   empname  salary
3    104      Ravi   40000
4    105  Abhishek   40000

In [12]:
df2.shape

(5, 3)

In [13]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   empid    5 non-null      int64
 1   empname  5 non-null      object
 2   salary   5 non-null      int64
dtypes: int64(2), object(1)
memory usage: 252.0+ bytes

In [14]:
df2.describe()

            empid         salary
count    5.000000       5.000000
mean   103.000000   82000.000000
std      1.581139  122556.109599
min    101.000000   10000.000000
25%    102.000000   20000.000000
50%    103.000000   40000.000000
75%    104.000000   40000.000000
max    105.000000  300000.000000